# Дана строка, состоящая из русских слов, разделенных пробелами (одним или несколькими). Найти количество слов в строке
s = 'Дома до звезд, а небо ниже'
lst = s.split()  # Разбиение строки по пробелам

print(len(k))  # Вывод длины списка
