info_authors = [
    (1, 'Пушкин', 'Александр'),
    (2, 'Толстой', 'Лев'),
    (3, 'Булгаков', 'Михаил'),
    (4, 'Гоголь', 'Николай'),
    (5, 'Тургенев', 'Иван'),
    (6, 'Иванов', 'Иван'),
    (7, 'Анисимова', 'Анна'),
    (8, 'Достоевский', 'Федор'),
    (9, 'Петров', 'Александр'),
    (10, 'Чехов', 'Антон')
]

info_books = [
    (1, 'Евгений Онегин', 1903, 'Книжный шкаф 1', 'Фантастика', 1),
    (2, 'Война и мир', 1892, 'Склад', 'Классика', 2),
    (3, 'Пиковая дама', 1887, 'Библиотека №1', 'Детективы', 1),
    (4, 'Ночь перед Рождеством', 1900, 'Книжный шкаф 2', 'Классика', 4),
    (5, 'Мастер и Маргарита', 1898, 'Библиотека №2', 'Детективы', 3),
    (6, 'Дубровский', 1896, 'Склад', 'Классика', 1),
    (7, 'Мертвые души', 1898, 'Книжный шкаф 3', 'Фантастика', 4),
    (8, 'Капитанская дочка', 1883, 'Склад', 'Классика', 1),
    (9, 'Муму', 1896, 'Библиотека №3', 'Детективы', 5),
    (10, 'Идиот', 1889, 'Склад', 'Классика', 8)
]

info_sections = [
    ('Фантастика',),
    ('Детективы',),
    ('Прозы',),
    ('Драмы',),
    ('Комедии',),
    ('Трагедии',),
    ('Элегии',),
    ('Оды',),
    ('Сказки',),
]

info_publishing = [
    ("O'Reilly Media", 'Москва'),
    ('Феникс', 'Санкт-Петербург'),
    ('Омега-Принт', 'Ростов-на-Дону'),
    ('Гинго', 'Москва'),
    ('Антей', 'Нижний Новгород'),
    ('Айрис-пресс', 'Ростов-на-Дону'),
    ('Евро Медиа', 'Москва'),
    ('Театральный вестник', 'Нижний Новгород'),
    ('Проф-Пресс', 'Ростов-на-Дону'),
    ('Альфа-книга', 'Москва')
]

info_author_book = [
    (1, 5, 10),
    (2, 1, 8),
    (3, 7, 6),
    (4, 1, 3),
    (5, 1, 1),
    (6, 1, 6),
    (7, 9, 3),
    (8, 4, 7),
    (9, 6, 1),
    (10, 10, 1)
]
